public class Main {
    public static void main(String[] args) {



        //Создать класс Address, расширяющий класс Employee.
        //Реализовать в нем конструктор и геттеры.
        //В классе Main создать двух работников с адреcами, напечатаь в консоли их адреса.




        System.out.println("Hello world!");
    }
}